var a=prompt("Введите число");
switch(a){
	case "1"://нахожу какое число ввел пользователь
	document.write("-На ветке сиди 1 ворона");//если было введенно число 1 то вывожу
	break;
	case "2"://нахожу какое число ввел пользователь
	case "3"://нахожу какое число ввел пользователь
	case "4"://нахожу какое число ввел пользователь
	document.write("-На ветке сиди"," ", a," ", "вороны");//если было введенно число от 2 до 4 вавожу это
	break;
	case "5"://нахожу какое число ввел пользователь
	case "6"://нахожу какое число ввел пользователь
	case "7"://нахожу какое число ввел пользователь
	case "8"://нахожу какое число ввел пользователь
	case "9"://нахожу какое число ввел пользователь
	case "10"://нахожу какое число ввел пользователь
	document.write("-На ветке сиди"," ", a," ", "ворон");//если было введенно число  от 5 до 10 вывожу это
	break;
}